tutorial/flow-over-heated-plate/fluid-openfoam/0.orig/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    interface
    {
        type            fixedGradient;
        gradient        uniform 0;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    slip-bottom
    {
        type            zeroGradient;
    }
    outerWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}
